//=============================================================================
//
// 背景処理 [bg.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _BG_H_
#define _BG_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "scene2D.h"

//=============================================================================
// クラス定義
//=============================================================================
class CBg : public CScene2D
{
public:
	CBg(PRIORITY obj);			// コンストラクタ
	~CBg();						// デストラクタ
	HRESULT Init(void);			// 初期化処理
	void Uninit(void);			// 開放処理
	void Update(void);			// 更新処理
	void Draw(void);			// 描画処理

	static CBg *Create(void);	// クリエイト処理
	static HRESULT Load(void);	// ロード処理

	void ShowInspector(void) {};

};
#endif