//==================================================================================================================
//
// box[box.h]
// Author:Ryouma Inoue
//
//==================================================================================================================
#ifndef _BOX_H_
#define _BOX_H_

//==================================================================================================================
// インクルードファイル
//==================================================================================================================
#include "main.h"
#include "scene.h"

//==================================================================================================================
// マクロ定義
//==================================================================================================================
#define Box_Depth 8																	// 縦のポリゴン数
#define Box_Width 15																// 横のブロック数

//==================================================================================================================
// 前方宣言
//==================================================================================================================
class CPlayer;
class CScene2D;

//==================================================================================================================
//
// クラスの定義
//
//==================================================================================================================
class CBox : public CScene
{
public:
	typedef enum
	{
		TEX_TYPE_NORMAL = 0,					// 通常
		TEX_TYPE_MASU,							// マス
		TEX_TYPE_MAX
	} TEX_TYPE;

	CBox(PRIORITY type);															// コンストラクタ
	~CBox();																		// デストラクタ
	HRESULT Init(void);																// 初期化処理
	void Uninit(void);																// 終了処理
	void Update(void);																// 更新処理
	void Draw(void);																// 描画処理

	void OnTriggerEnter(CCollider *col) {};
	void OnCollisionEnter(CCollider *col) {};

	static CBox *Create(void);														// 生成処理
	static HRESULT Load(void);														// テクスチャ情報ロード
	static void Unload(void);														// テクスチャ情報アンロード

protected:

private:
	static LPDIRECT3DTEXTURE9 m_pTexture[TEX_TYPE_MAX];									// テクスチャへのポインタ
	bool m_bPuzzle[Box_Depth][Box_Width];											// 使用しているかどうか
	CScene2D *m_pBlock[Box_Depth][Box_Width];

	TEX_TYPE m_type[Box_Depth][Box_Width];
};
#endif