//==================================================================================================================
//
// box[box.h]
// Author:Ryouma Inoue
//
//==================================================================================================================
#ifndef _BOX_H_
#define _BOX_H_

//==================================================================================================================
// インクルードファイル
//==================================================================================================================
#include "main.h"
#include "scene.h"

//==================================================================================================================
// マクロ定義
//==================================================================================================================
#define Box_Depth 8																	// 縦のポリゴン数
#define Box_Width 15																// 横のブロック数

//==================================================================================================================
// 前方宣言
//==================================================================================================================
class CPlayer;
class CScene2D;

//==================================================================================================================
//
// クラスの定義
//
//==================================================================================================================
class CBox : public CScene
{
public:

	CBox(PRIORITY type);															// コンストラクタ
	~CBox();																		// デストラクタ
	HRESULT Init(void);																// 初期化処理
	void Uninit(void);																// 終了処理
	void Update(void);																// 更新処理
	void Draw(void);																// 描画処理

	void OnTriggerEnter(CCollider *col) {};
	void OnCollisionEnter(CCollider *col) {};
	bool GetPlaacement(void){ return m_bCreate; }									// 配置情報取得

	static CBox *Create(void);														// 生成処理
	static HRESULT Load(void);														// テクスチャ情報ロード
	static void Unload(void);														// テクスチャ情報アンロード

protected:

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;											// テクスチャへのポインタ
	bool m_bPuzzle[Box_Depth][Box_Width];											// 使用しているかどうか
	CScene2D *m_pBlock[Box_Depth][Box_Width];										// シーン2Dのポインタ

	int m_nCntMove_X;																// 移動カウントX
	int m_nCntMove_Y;																// 移動カウントY

	bool m_bPlacement;																// 配置しているかどうか
	bool m_bCreate;																	// 生成するかどうか
	bool m_bMove;																	// 動くかどうか
};
#endif