//=============================================================================
//
// ライト処理 [light.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_LIGHT 3

//=============================================================================
// 前方宣言
//=============================================================================
class CObject;

//=============================================================================
// クラス定義
//=============================================================================
class CLight
{
public:
	CLight();				// コンストラクタ
	~CLight();				// デストラクタ
	HRESULT Init(void);		// 初期化処理
	void Uninit(void);		// 開放処理
	void Update(void);		// 更新処理

	D3DLIGHT9 GetLight(const int nIndex);		// ライトの取得
	D3DXVECTOR3 GetPos(void) { return m_pos; }		// 位置の取得

private:
#ifdef _DEBUG
	void Debug(void);							// デバッグ処理
	CObject *m_pDirectionalLight;					// 太陽
#endif
	D3DLIGHT9 m_aLight[MAX_LIGHT];				// ライト情報
	D3DXVECTOR3 m_pos;			// ライトの位置
};
#endif
