//=============================================================================
//
// フェーズ数表示処理 [phase.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _PHASE_H_
#define _PHASE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "scene2D.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_DAYNUMBER 2							// 数字の桁数

//=============================================================================
// 前方宣言
//=============================================================================
class CNumber;

//=============================================================================
// クラス定義
//=============================================================================
class CPhase : public CScene2D
{
public:
	CPhase(PRIORITY obj);						// コンストラクタ
	~CPhase();									// デストラクタ
	HRESULT Init(void);							// 初期化処理
	void Uninit(void);							// 開放処理
	void Update(void);							// 更新処理
	void Draw(void);							// 描画処理

	static CPhase *Create(void);				// クリエイト処理
	static HRESULT Load(void);					// ロード処理

	void SetNumber(int nValue);					// 数字の設定
	void AddNumber(int nValue);					// 数字の加算

	int GetNumber(void){ return m_nNumber; }	// 数字の取得

private:
	CNumber *m_apNumber[MAX_DAYNUMBER];			// 数字のポインタ
	int m_nNumber;								// 数字
};
#endif