//=============================================================================
//
// タイトルロゴ処理 [titleLogo.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _TITLELOGO_H_
#define _TITLELOGO_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// 列挙体定義
//=============================================================================
typedef enum
{
	LOGOTYPE_IF = 0,
	LOGOTYPE_AKAZUKIN,
	LOGOTYPE_ATTACK,
	LOGOTYPE_PRESS,
	LOGOTYPE_MAX
} LOGOTYPE;

//=============================================================================
// 前方宣言
//=============================================================================
class CScene2D;

//=============================================================================
// クラス定義
//=============================================================================
class CTitlelogo
{
public:
	CTitlelogo();						// コンストラクタ
	~CTitlelogo();						// デストラクタ
	HRESULT Init(void);					// 初期化処理
	void Uninit(void);					// 開放処理
	void Update(void);					// 更新処理
	void Draw(void);					// 描画処理

	static CTitlelogo *Create(void);	// クリエイト処理
	static HRESULT Load(void);			// ロード処理

private:
	CScene2D *m_apScene2D[LOGOTYPE_MAX];	// シーンのポインタ
};
#endif