//=============================================================================
//
// スクリプト書き込み処理 [write.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _WRITE_H_
#define _WRITE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// クラス定義
//=============================================================================
class CWrite
{
public:
	static bool Open(const std::string &add);
	static bool Write(const char* frm, ...);
	static bool TitleWrite(const char* frm, ...);
	static bool IndexWrite(const char* frm, ...);
	static bool End(void);

private:
	static FILE *pFile;					// ファイルのポインタ
};
#endif