//=============================================================================
//
// スクリプト書き込み処理 [write.h]
// Author : masayasu wakita
//
//=============================================================================
#ifndef _WRITE_H_
#define _WRITE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// クラス定義
//=============================================================================
class CWrite
{
public:
	CWrite();
	~CWrite();
	bool Open(const std::string &add);
	bool Write(const char* frm, ...);
	bool TitleWrite(const char* frm, ...);
	bool IndexWrite(const char* frm, ...);
	bool End(void);

private:
	FILE *m_pFile;					// ファイルのポインタ
};
#endif